Revit 2026 API

# TagHeadAlignment Enumeration

---

An enumerated type listing the tag-head alignment options supported by the Bending Detail.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TagHeadAlignment
```
```vb
Public Enumeration TagHeadAlignment
```
```cpp
public enum class TagHeadAlignment
```
```fsharp
type TagHeadAlignment
```

| Member name | Value | Description |
| --- | --- | --- |
| RebarShapeFamily | 0 | The tag-head is aligned using the rebar shape family direction. |
| View | 1 | The tag-head is aligned using the view. |

#### Reference

Autodesk.Revit.DB Namespace